// আমরা ডাবল ইকুয়েল == ও ট্রিপল ইকুয়েল === সম্বন্ধে জানবো

// ডাবল ইকুয়েল

// ডাবল ইকুয়েল ভ্যালু চ্যাক করে আর যেই টাইপ আছে তাকে কনভার্ট করে ফেলে।যেমন

let number = 2;
let string = "2";

if (number == string) {
    console.log("condtition is true");
}
else {
    console.log("condition is false");
}

// এখানে আমরা দেখতে পারছি একটা নাম্বার আর স্ট্রিং থাকা সত্তেও ডাবল ইকুয়েল একে সত্য বলছে। 

// ট্রিপল ইকুয়েল === 

const triple = 2;
const tripleArray = "2";

if (triple === tripleArray) {
    console.log("condtition is true");
}
else {
    console.log("condition is false");
}


// কিন্তু ট্রিপল ইকুয়েল এ তা মিথ্যা বলছে


// এর থেকে আমরা বুঝতে পারি ডাবল ইকুয়েল ভ্যালু চ্যাক করে পাশাপাশি যে টাইপ থাকে তাকে কনভার্ট করে ফেলে।

// কিন্তু ট্রিপল ইকুয়েল ভ্যালু চ্যাক করার পাশাপাশি টাইপ ও চ্যাক করে অর্থ্যাত এরা নাম্বার নাকি বুলিয়ান এসব ও চ্যাক করে। তাই ট্রিপল ইকুয়েল ব্যবহার করতে হবে।
